//=============================================================================
//
// プレイヤー処理 [player.h]
// Author : GP12A295 25 人見友基
//
//=============================================================================
#ifndef _PLAYER_H_
#define _PLAYER_H_

/*******************************************************************************
* インクルード
*******************************************************************************/
#include "object.h"
#include "SkinMeshX.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
// モデル
#define MODEL_PLAYER				("test.x")

// モデルの最大数
#define MODEL_PLAYER_MAX			(1)

// モデルスケール
#define MODEL_PLAYER_SCL			(0.5f)

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************

class Player : public Object
{
private:
	CSkinMesh		*m_CSkinMesh;		// スキンメッシュ格納用
	D3DXVECTOR3		m_vPos;				// 座標情報
	D3DXVECTOR3		m_vRot;				// 回転情報
	D3DXVECTOR3		m_vScl;				// 拡縮情報
	D3DXMATRIX		m_mtxWorld;			// ワールドマトリクス
	bool			m_bUse;				// 使用フラグ
public:
	enum PLAYER
	{	// プレイヤー管理
		PLAYER_1P,
		PLAYER_MAX
	};

	// コンストラクタ（初期化処理）
	Player(void);
	//デストラクタ（終了処理）
	~Player(void);

	// 更新処理
	void	Update(void);
	// 描画処理
	void	Draw(void);
private:

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

#endif
