//=============================================================================
//
// モデル処理 [XModel.h]
// Author : GP12A295 25 人見友基
//
//=============================================================================
#ifndef _XMODEL_H_
#define _XMODEL_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
// スキンメッシュクラス
class CXModel
{
private:
	LPDIRECT3DTEXTURE9	m_pD3DTexture;		// テクスチャへのポインタ
	LPD3DXMESH			m_pD3DXMesh;		// メッシュ情報へのポインタ
	LPD3DXBUFFER		m_pD3DXBuffMat;		// マテリアル情報へのポインタ
	DWORD				m_nNumMat;			// マテリアル情報の数
public:
	// コンストラクタ
	CXModel();
	// デストラクタ
	~CXModel() { Release(); }

	// スキンメッシュ内部処理
	HRESULT Init(LPDIRECT3DDEVICE9, LPSTR, LPSTR);
	// 解放処理
	void Release();
	// 更新処理
	void Update(void);
	// 描画処理
	void Draw(D3DXMATRIX);
};
#endif